run/tutorials/case4_structure/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh    interfaceFrontFvMesh;
motionSolverLibs ( "libLiquefactionFvMeshFields.so" );

interfaceFrontFvMeshCoeffs
{

    wallFz    wall;
    master    liq;
    slave     sol;
    direction (0 0 -1);
}


// ************************************************************************* //
