run/tutorials/case4_structure/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/caseInfo"

E              E [ 1 -1 -2 0 0 0 0 ] $E;

E2             E2 [ 1 -1 -2 0 0 0 0 ] 1.5e6;

nu             nu [ 0 0 0 0 0 0 0 ] $nu;

k              k [ 0 1 -1 0 0 0 0 ] $k;

K              K [ 1 -1 -2 0 0 0 0 ] $K;

Sr             Sr [ 0 0 0 0 0 0 0 ] $Sr;

p0             p0 [ 1 -1 -2 0 0 0 0 ] $p0;

gamma          gamma [ 1 -2 -2 0 0 0 0 ] 9810;

n1           	n1 [ 0 0 0 0 0 0 0 ] $n1;

n2             n2 [ 0 0 0 0 0 0 0 ] $n2;

k0             k0 [0 0 0 0 0 0 0 ] $k0;

g              g [ 0 1 -2 0 0 0 0 ] (0 0 -9.81);

relDensity     relDensity [0 0 0 0 0 0 0 ] $relDensity;

relDensity2    relDensity2 [0 0 0 0 0 0 0] 0.86;

gammaD         gammaD [1 -2 -2 0 0 0 0 ]8122.2;

rhof           rhof [1 -3 0 0 0 0 0] $rhof;

rhom           rhom [1 -3 0 0 0 0 0] 1811.4 ;

rhos           rhos [1 -3 0 0 0 0 0] $rhos ;

rhoa           rhoa [1 -3 0 0 0 0 0] $rhoa ;

QbyBL          QbyBL [1 -1 -2 0 0 0 0] $QbyBL;

Us             Us [1 -2 -2 0 0 0 0] 0;

vis            vis [1 -1 -1 0 0 0 0] $vis;

//Q              Q    [1 -1 -2 0 0 0 0] 34.3;

q              q [0 0 0 0 0 0 0] $q;

V0             V0 [0 1 -1 0 0 0 0] (0 0 $V0);

C              C [1 -1 -1 0 0 0 0] $C;

wh             wh [0 1 0 0 0 0 0 ] $wh;

emax           emax [0 0 0 0 0 0 0] $emax;

emin           emin [0 0 0 0 0 0 0] $emin;

ms             ms [1 -2 -2 0 0 0 0] 0;

Ur1            Ur1 [1 -2 -2 0 0 0 0] $Ur1;

Ur2            Ur2 [1 -2 -2 0 0 0 0] $Ur2; 

fw             fw [0 1 0 0 0 0 0] $fw; 

planeStress     no;

stationary     yes;

loading        no;

steady         no;
// ************************************************************************* //
