run/tutorials/case4_structure/0/Cl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seaBed
    {
        type            zeroGradient;
    }
    /*seabedFoundation
    {
        type            splitCyclic;
    }
    foundationSeabed
    {
        type            splitCyclic;
    }*/
    "seabedFoundation1|seabedFoundation2|seabedFoundation3"
    {
        type            splitCyclic;
    }
    "foundationSeabed1|foundationSeabed2|foundationSeabed3"
    {
        type            splitCyclic;
    }
    foundationTop
    {
        type            zeroGradient;
    }
    soilDomainBottom
    {
        type            zeroGradient;
    }
    left
    {
        type            splitCyclic;
    }
    right
    {
        type            splitCyclic;
    }
    frontBack
    {
        type            empty;
    }
    liq
    {
        type            splitCyclic;
    }
    sol
    {
        type            splitCyclic;
    }
}


// ************************************************************************* //
